import React from 'react';
import { Link } from 'react-router-dom';
import '../styles/PrivacyPolicy.css';

function PrivacyPolicy() {

  const today = new Date().toLocaleDateString('bg-BG');
  return (
    <main className="policy-page">
      <h1>Политика за поверителност</h1>
      <p className="update-date">Последна актуализация: {today}</p>

      <p>
        Тази Политика за поверителност описва как РокС EООД („Сайтът", „ние", „нас" или „наш")
        събира, използва и разкрива Вашата лична информация, когато посещавате, използвате нашите услуги или правите
        покупка от www.ledrollers.com („Сайтът“) или по друг начин комуникирате с нас (наричани заедно „Услугите").
        За целите на тази Политика за поверителност „Вие" и „Ваш" означава Вас като потребител на Услугите, независимо дали
        сте клиент, или посетител.
      </p>

      <h2>Как събираме и използваме Вашата лична информация</h2>
      <p>
        За да предоставим Услугите, ние събираме лична информация за Вас от различни източници, както е посочено по-долу.
      </p>

      <h3>Информация, която събираме директно от Вас:</h3>
      <ul>
        <li>Данни за контакт: Вашето име, телефонен номер и имейл.</li>
        <li>
          Информация за поръчка: Вашето име, адрес за доставка (личен или офис на куриер), имейл
          адрес и телефонен номер.
        </li>
        <li>Информация за поддръжка на клиенти: Информацията, която изберете да включите в комуникацията с нас.</li>
      </ul>

      <h3>Информация, която получаваме от трети страни:</h3>
      <ul>
        <li>
          Компании, които поддържат нашия Сайт: Като например нашата хостинг компания или платформата, на която е изграден
          сайтът.
        </li>
        <li>
          Куриерски фирми: Които получават Вашите данни (име, адрес, телефон), за да доставят поръчката Ви (
          с Еконт).
        </li>
      </ul>

      <h2>Как използваме Вашата лична информация</h2>
      <ul>
        <li>
          Предоставяне на продукти и услуги: Ние използваме Вашата лична информация, за да изпълним договора си с Вас,
          включително да обработим плащанията Ви, да изпълним поръчките Ви и да уреждаме доставката и евентуални връщания.
        </li>
        <li>
          Комуникация с Вас: Ние използваме Вашата лична информация, за да Ви предоставим поддръжка на клиенти и да
          отговорим на Ваши запитвания.
        </li>
        <li>
          Сигурност и предотвратяване на измами: Ние използваме Вашата лична информация, за да защитим нашия сайт от
          злонамерена дейност.
        </li>
      </ul>

      <h2>Как разкриваме лична информация</h2>
      <p>
        При определени обстоятелства може да разкрием Вашата лична информация на трети страни за целите на изпълнение на
        договора:
      </p>
      <ul>
        <li>
          С доставчици или други трети страни, които извършват услуги от наше име (напр. куриерски фирми за доставка,
          счетоводители за издаване на фактури).
        </li>
        <li>
          За спазване на приложими законови задължения съгласно законите на Република България.
        </li>
      </ul>
      <p>Ние не продаваме Вашите лични данни на трети лица.</p>

      <h2>Бисквитки</h2>
      <p>
        Подобно на много уебсайтове, ние използваме „бисквитки“ на нашия Сайт. Използваме ги, за да предоставяме и
        подобряваме нашите Услуги. Повече информация за това какви бисквитки използваме и как можете да ги управлявате,
        можете да намерите в нашата страница <Link to="/cookies"><strong>Политика за бисквитки</strong></Link>.
      </p>

      <h2>Вашите права</h2>
      <p>
        Според Общия регламент относно защитата на данните (GDPR), Вие разполагате със следните права:
      </p>
      <ul>
        <li>
          Право на достъп: Да поискате достъп до личната информация, която съхраняваме за Вас.
        </li>
        <li>
          Право на изтриване: Да поискате да изтрием личната информация, която съхраняваме за Вас (т.нар. "право да
          бъдеш забравен").
        </li>
        <li>
          Право на коригиране: Да поискате да коригираме неточната лична информация.
        </li>
      </ul>
      <p>
        Можете да упражните което и да е от тези права, като се свържете с нас чрез данните за контакт, посочени по-долу.
      </p>

      <h2>Сигурност и съхранение на Вашата информация</h2>
      <p>
        Ние предприемаме разумни мерки за защита на Вашата информация. Данните, свързани с Вашата поръчка, се пазят за
        срока на законовата гаранция на продуктите и правото на връщане (14 дни). Счетоводните документи (фактури) се
        съхраняват за срок от 10 години, съгласно Закона за счетоводството.
      </p>

      <h2>Контакт</h2>
      <p>
        Ако имате въпроси относно нашите практики за поверителност или искате да упражните някое от правата си, моля,
        свържете се с нас на:
      </p>
      <ul>
        <li>Имейл: ledrollersshoes@gmail.com</li>
        <li>Телефон: 0888335992</li>
        <li>Адрес: град София</li>
      </ul>

      <p>
        За целите на приложимите закони за защита на данните, ние сме администраторът на личните Ви данни.
      </p>
    </main>
  );
}

export default PrivacyPolicy;
